using System;

namespace OOP
{
    class Program
    {
        static void Main(string[] args)
        {
            //1. Общий класс департамент
            //2. Общий класс сотрудник

            // Задание 1.
            // Спроектировать информационную систему позволяющей работать со следующей структурой:
            // Организация, в которой есть департаменты и сотрудники.
            // Наполнение деталями предлагается реализовать самостоятельно
            // Наполнение сотрудниками и департаментами происходит автоматически из файла *.txt, 
            //                                                           предпочтительнее *.xml или *.json 
            //
            // Сотрудники делятся на несколько групп, разделенных должностями и оплатой труда
            // Есть 
            //   сотрудники - управленцы (например: директор, Первй заместитель директора, начальник ведомства, 


            //   сотрудники - рабочие
            //   интерны
            // У интернов оплата труда фиксированная и определяется при приёме (например $500 в месяц)
            // У сотрудников - рабочих оплата труда почасовая и определяется при приёме (например $12 в час)
            // У сотрудников - управленцев оплата труда составляет 15% от общей выплаченной суммы всем сотрудникам 
            // числящихся в его отделе, но не менее $1300. 
            //
            // Структура организации следующая:
            // Организация, состоит из ведомств в которые включены департаменты
            // У каждого ведомства и департамента есть свой начальник.
            // Директор руководит Организацией
            // 
            // Реализовать и продемонстрировать работу информационной системы
            // В консоли или с использованием UI

       

        }
    }
}
